research-topics/index.org
#+title: Research Topics
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="../style.css" />
#+OPTIONS: html-style:nil toc:nil title:nil num:nil timestamp:nil

#+begin_export html
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>
#+end_export

#+INCLUDE: ../logo.org

* Research Interests

** [[./PIR.org][Private Information Retrieval]]
The problem of Private Information Retrieval (PIR), seeks efficient ways for a user to retrieve data from distributed servers privately. A user wishes to retrieve one file among a set of files stored across servers. But the servers should not know the identity of the desired file. In order to retrieve its desired file privately, user generates queries to send to the servers. After receiving their respective queries, servers will construct answers which are a function of the query they got and the files they have. After receiving answers from all the servers, the user should be able to decode the desired file. The goal of PIR is to reduce the communication cost among user and servers while preserving users' demand privacy against servers.

** [[./coded-caching.org][Coded Caching]]
The high temporal variability of network traffic results in communication systems that are congested during peak-traffic times and underutilized during off-peak times. One approach to reduce peak traffic is to take advantage of memories distributed across the network (at end users, routers, …) to duplicate content. This duplication of content, called content placement or caching, is performed during off-peak hours when network resources are abundant. During peak hours, when network resources are scarce, user requests can then be served exploiting these caches to reduce network congestion.

In a centralized coded caching system, a server stores $N$ independent files $\{W_{0} , \ldots , W_{N-1}\}$, each of size $L$ bits. There are $K$ users, each equipped with a cache memory of $ML$ bits. The system works in two phases. In delivery phase, when the network is not congested, the server fills the caches with the contents of the files. Then, in delivery phase, all users wish to retrieve some files from the servers. User $k$ wishes to retrieve file $d_{k} \in [0:N-1]$. Every user conveys the index of their desired file to the server. After receiving the demands from the users, the server broadcasts coded transmissions $\mathbf{X}$ of size $R_{CC}L$ bits. The transmission $\mathbf{X}$ is a function of the files stored at the server and users' demand. After receiving the coded transmission $\mathbf{X}$, all the users should be able to retrieve their desired files with the help of their cache content. The quantity $R_{CC}$ is a measure of the size of the server's transmissions and the goal of coded caching problem is to design placement and delivery strategies to minimize $R_{CC}$.

** [[./computing.org][Distributed Machine Learning]]
In distributed computation system, a master performs a computation by distributing it into smaller sub-computations and each sub-computation is performed by a worker node. Slow workers, also known as stragglers nodes, could become a bottleneck for the computation. As master's data is being shared by external workers, the privacy of data and master's behavior (demand patterns etc.) is also a matter of concern. Also distributed computations are much more susceptible to erroneous communication or malicious workers that may send arbitrary data to affect the computation. While these constraints are building upon distributed computing framework, low upload and download costs are preferred. Coding theoretic techniques are being used to overcome these and other challenges in distributed computation.

** [[./PID.org][Private Information Delivery]]
In Private Information Delivery (PID), a dataset comprised of $K$ identically distributed messages is stored over $N$ servers. The servers want to convey one of the $K$ messages to a user but don't want the identity of message to be disclosed to the user. For example, the data stored at the servers could be medical records of patients from some hospitals. These hospitals want to send the record of one of the patients externally but want to preserve the privacy of the patient.

In order to convey a message to the user, without disclosing the identity of the message, servers may have to transmit more data than the actual size of the message. Because of this, the goal of PID problem is to reduce the transmission cost while keeping the identity of the message private.
