docs/research-topics/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Research Topics</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="../style.css" />
</head>
<body>
<div id="content" class="content">
<ul class="sidebar" id="mySideNav">
  <a href="javascript:void(0);" class="icon" onclick="myFunction()"><b>MENU</b></a>
  <a href="../index.html">Home</a>
  <a class="active" href="../research-topics/index.html">Research Topics</a>
  <a href="../publications.html">Publications</a>
  <a href="../projects/index.html">Projects</a>
  <a href="../bio.html">Bio</a>
</ul>

<div class="logo">
<a class="logo__link" title="Kanishak Vaidya" rel="home">
<div class="logo__item logo__text">
<div class="logo__title">Kanishak Vaidya</div>
<div class="logo__tagline">PhD fellow in IISc Bangalore</div>
</div></a>
<!-- div style="float:right;">
  <div class="toggle-light light" ></div >
</div-->
</div>

<script>
function myFunction() {
  var x = document.getElementById("mySideNav");
  if (x.className === "sidebar") {
    x.className += " responsive";
  } else {
    x.className = "sidebar";
  }
}
</script>

<div id="outline-container-org1af20b6" class="outline-2">
<h2 id="org1af20b6">Research Interests</h2>
<div class="outline-text-2" id="text-org1af20b6">
</div>
<div id="outline-container-org0d9e02b" class="outline-3">
<h3 id="org0d9e02b"><a href="./PIR.html">Private Information Retrieval</a></h3>
<div class="outline-text-3" id="text-org0d9e02b">
<p>
The problem of Private Information Retrieval (PIR), seeks efficient ways for a user to retrieve data from distributed servers privately. A user wishes to retrieve one file among a set of files stored across servers. But the servers should not know the identity of the desired file. In order to retrieve its desired file privately, user generates queries to send to the servers. After receiving their respective queries, servers will construct answers which are a function of the query they got and the files they have. After receiving answers from all the servers, the user should be able to decode the desired file. The goal of PIR is to reduce the communication cost among user and servers while preserving users&rsquo; demand privacy against servers.
</p>
</div>
</div>

<div id="outline-container-org5a85b8f" class="outline-3">
<h3 id="org5a85b8f"><a href="./coded-caching.html">Coded Caching</a></h3>
<div class="outline-text-3" id="text-org5a85b8f">
<p>
The high temporal variability of network traffic results in communication systems that are congested during peak-traffic times and underutilized during off-peak times. One approach to reduce peak traffic is to take advantage of memories distributed across the network (at end users, routers, …) to duplicate content. This duplication of content, called content placement or caching, is performed during off-peak hours when network resources are abundant. During peak hours, when network resources are scarce, user requests can then be served exploiting these caches to reduce network congestion.
</p>

<p>
In a centralized coded caching system, a server stores \(N\) independent files \(\{W_{0} , \ldots , W_{N-1}\}\), each of size \(L\) bits. There are \(K\) users, each equipped with a cache memory of \(ML\) bits. The system works in two phases. In delivery phase, when the network is not congested, the server fills the caches with the contents of the files. Then, in delivery phase, all users wish to retrieve some files from the servers. User \(k\) wishes to retrieve file \(d_{k} \in [0:N-1]\). Every user conveys the index of their desired file to the server. After receiving the demands from the users, the server broadcasts coded transmissions \(\mathbf{X}\) of size \(R_{CC}L\) bits. The transmission \(\mathbf{X}\) is a function of the files stored at the server and users&rsquo; demand. After receiving the coded transmission \(\mathbf{X}\), all the users should be able to retrieve their desired files with the help of their cache content. The quantity \(R_{CC}\) is a measure of the size of the server&rsquo;s transmissions and the goal of coded caching problem is to design placement and delivery strategies to minimize \(R_{CC}\).
</p>
</div>
</div>

<div id="outline-container-org51b006d" class="outline-3">
<h3 id="org51b006d"><a href="./computing.html">Distributed Machine Learning</a></h3>
<div class="outline-text-3" id="text-org51b006d">
<p>
In distributed computation system, a master performs a computation by distributing it into smaller sub-computations and each sub-computation is performed by a worker node. Slow workers, also known as stragglers nodes, could become a bottleneck for the computation. As master&rsquo;s data is being shared by external workers, the privacy of data and master&rsquo;s behavior (demand patterns etc.) is also a matter of concern. Also distributed computations are much more susceptible to erroneous communication or malicious workers that may send arbitrary data to affect the computation. While these constraints are building upon distributed computing framework, low upload and download costs are preferred. Coding theoretic techniques are being used to overcome these and other challenges in distributed computation.
</p>
</div>
</div>

<div id="outline-container-orge5523ca" class="outline-3">
<h3 id="orge5523ca"><a href="./PID.html">Private Information Delivery</a></h3>
<div class="outline-text-3" id="text-orge5523ca">
<p>
In Private Information Delivery (PID), a dataset comprised of \(K\) identically distributed messages is stored over \(N\) servers. The servers want to convey one of the \(K\) messages to a user but don&rsquo;t want the identity of message to be disclosed to the user. For example, the data stored at the servers could be medical records of patients from some hospitals. These hospitals want to send the record of one of the patients externally but want to preserve the privacy of the patient.
</p>

<p>
In order to convey a message to the user, without disclosing the identity of the message, servers may have to transmit more data than the actual size of the message. Because of this, the goal of PID problem is to reduce the transmission cost while keeping the identity of the message private.
</p>
</div>
</div>
</div>
</div>
</body>
</html>
